import {
  _ as l,
  o as t,
  c as n,
  a as e,
  b as a,
  e as i,
} from "./app-a7d5d4b7.js";
const r = "/images/metamask.png?raw=true",
  s = "/images/noMetamask.png?raw=true",
  d = "/images/seeds.png",
  h = "/images/signature.svg",
  c = "/images/signature-pink.svg",
  o = "/images/signature-blue.svg",
  u = "/images/signature-gold.svg";
const p = {},
  m = e(
    "div",
    { dir: "rtl", markdown: "1" },
    [
      e("h1", { id: "کیف-پول‌-ارزهای-مجازی", tabindex: "-1" }, [
        e(
          "a",
          {
            class: "header-anchor",
            href: "#کیف-پول‌-ارزهای-مجازی",
            "aria-hidden": "true",
          },
          "#"
        ),
        a(" کیف پول‌ ارزهای مجازی"),
      ]),
      e("h2", { id: "کیف-پول-اتریوم-چیست", tabindex: "-1" }, [
        e(
          "a",
          {
            class: "header-anchor",
            href: "#کیف-پول-اتریوم-چیست",
            "aria-hidden": "true",
          },
          "#"
        ),
        a(" کیف پول اتریوم چیست"),
      ]),
      e(
        "p",
        null,
        "شما نیاز به یک کیف پول دارید که وجوه را ارسال یا دریافت کنید و همچنین ارز مجازی‌تان را مدیریت کنید. این کیف پول‌‌ها برنامه‌ای کاربردی هستند که به شما امکان استفاده از حساب اتریوم و دیگر بلاک‌چین‌ها را می‌دهند. به آن به چشم یک برنامه بانکداری ابنترنتی بدون بانک نگاه کنید. کیف پول به شما امکان می‌دهد موجودی خود را بخوانید، تراکنش‌ها را بفرستید، و به Dapp ها (اپلیکیشن ‌های روی بستر بلاک‌چین) متصل شوید."
      ),
      e(
        "p",
        null,
        "کیف پول شما تنها یک ابزار برای مدیدریت حساب شما روی بلاک‌چین است. هیچ سازمان یا شرکتی و حتی SAY به کیف پول شما دسترسی ندارد . این بدین معنی است که می‌توانید ارائه دهنده کیف پول خود را در هر زمانی عوض کنید. بسیاری از کیف پول‌ها به شما امکان استفاده همزمان از چندین حساب اتریوم برای یک برنامه را می‌دهند."
      ),
      e("ul", null, [
        e(
          "li",
          null,
          "در حال حاضر از طریق Metamask و WalletConnect شما قادر به اتصال به SAY DAO هستید."
        ),
      ]),
      e("h2", { id: "نصب-کیف-پول", tabindex: "-1" }, [
        e(
          "a",
          {
            class: "header-anchor",
            href: "#نصب-کیف-پول",
            "aria-hidden": "true",
          },
          "#"
        ),
        a(" نصب کیف پول"),
      ]),
      e(
        "p",
        null,
        "برای اینکه شما بتوانید از برخی قابلیت‌های SAY استفاده کنید نیاز به یک کیف پول ارزهای مجازی دارید،"
      ),
      e("ul", null, [
        e("li", null, "امضای دیجیتال نیازها"),
        e("li", null, "ممشارکت در سرنوشت SAY با رای دادن"),
        e("li", null, "ذخیره سهام / ارز مجازی SAY"),
        e("li", null, "..."),
      ]),
      e(
        "p",
        null,
        "با کلیک کردن بر روی دکمه اتصال کیف پول در صفحه من، صفحه زیر برای شما باز می‌شود. در صورت نصب نبودن کیف پول Metamask پیشنهاد می‌شود که این کیف پول را دانلود و نصب کنید."
      ),
      e("div", null, [
        e("img", {
          style: { margin: "20px" },
          src: r,
          alt: "metamask",
          width: "300",
        }),
        e("img", {
          style: { margin: "20px" },
          src: s,
          alt: "metamask",
          width: "300",
        }),
      ]),
      e("p", null, "برای آشنایی با این کیف پول ویدیو زیر را تماشا کنید."),
      e("div", { class: "h_iframe-aparat_embed_frame" }, [
        e("span", { style: { display: "block", "padding-top": "57%" } }),
        e("iframe", {
          style: { right: "0px", margin: "auto" },
          src: "https://www.aparat.com/video/video/embed/videohash/jv3Yn/vt/frame",
          allowFullScreen: "true",
          webkitallowfullscreen: "true",
          mozallowfullscreen: "true",
        }),
      ]),
      e("h2", { id: "چگونه-ایمن-بمانیم", tabindex: "-1" }, [
        e(
          "a",
          {
            class: "header-anchor",
            href: "#چگونه-ایمن-بمانیم",
            "aria-hidden": "true",
          },
          "#"
        ),
        a(" چگونه ایمن بمانیم"),
      ]),
      e(
        "p",
        null,
        "وقتی صحبت از ایمنی به میان می‌آید، کیف پول تغییر در طرز فکرهاست. آزادی مالی و امکان دسترسی و استفاده از وجوه در هر کجا با کمی مسئولیت همراه است – هیچ پشتیبانی مشتری در رمز ارز وجود ندارد."
      ),
      e("h5", { id: "مسئولیت-وجوهتان-را-به-عهده-بگیرید", tabindex: "-1" }, [
        e(
          "a",
          {
            class: "header-anchor",
            href: "#مسئولیت-وجوهتان-را-به-عهده-بگیرید",
            "aria-hidden": "true",
          },
          "#"
        ),
        a(" مسئولیت وجوهتان را به عهده بگیرید"),
      ]),
      e(
        "p",
        null,
        "صرافی‌های نامتمرکز کیف پولتان را به یک نام کاربری و رمز عبور پیوند می‌دهند و شما می‌توانید از روش‌های سنتی اقدام به بازیابی کنید. فقط به یاد داشته باشید که با این کار دارید به حضانت وجوهتان نزد آن صرافی نامتمرکز اعتماد می‌کنید. اگر آن شرکت مورد حمله قرار گیرد یا ورشکست شود، وجوهتان به خطر می‌افتد."
      ),
      e("h5", { id: "عبارت-seed-را-یادداشت-کنید", tabindex: "-1" }, [
        e(
          "a",
          {
            class: "header-anchor",
            href: "#عبارت-seed-را-یادداشت-کنید",
            "aria-hidden": "true",
          },
          "#"
        ),
        a(" عبارت seed را یادداشت کنید"),
      ]),
      e(
        "p",
        null,
        "کیف پول‌ها به شما یک عبارت بازیابی می‌دهند که باید آن را در جایی مطمئن یادداشت کنید. این، تنها راهی است که با آن می‌توانید کیف پول خود را بازیابی کنید. آن را روی کامپیوتر ذخیره نکنید. آن را جایی بنویسید و ایمن نگه دارید."
      ),
      e("p", null, "این مثال را ببنید:"),
      e("div", { style: { display: "flex", "justify-content": "center" } }, [
        e("img", { src: d, alt: "drawing", width: "300" }),
      ]),
      e("h5", { id: "کیف-پول-خود-را-نشانگذاری-کنید", tabindex: "-1" }, [
        e(
          "a",
          {
            class: "header-anchor",
            href: "#کیف-پول-خود-را-نشانگذاری-کنید",
            "aria-hidden": "true",
          },
          "#"
        ),
        a(" کیف پول خود را نشانگذاری کنید"),
      ]),
      e(
        "p",
        null,
        "اگر از کیف پول تحت وب استفاده می‌کنید، وبسایت را نشانگذاری کنید تا از شر کلاهبرداری در امان بمانید."
      ),
      e("h5", { id: "هر-چیزی-را-سه-بار-بررسی-کنید", tabindex: "-1" }, [
        e(
          "a",
          {
            class: "header-anchor",
            href: "#هر-چیزی-را-سه-بار-بررسی-کنید",
            "aria-hidden": "true",
          },
          "#"
        ),
        a(" هر چیزی را سه بار بررسی کنید"),
      ]),
      e(
        "p",
        null,
        "به یاد داشته باشید که تراکنش ها برگشت پذیر و کیف پول‌ها به سادگی قابل بازیابی نیستند، پس احتیاط کنید و همیشه مراقب باشید."
      ),
      e("h2", { id: "امضای-دیجیتال", tabindex: "-1" }, [
        e(
          "a",
          {
            class: "header-anchor",
            href: "#امضای-دیجیتال",
            "aria-hidden": "true",
          },
          "#"
        ),
        a(" امضای دیجیتال"),
      ]),
      e(
        "p",
        null,
        'در فرایند استفاده از کیف پول‌های بلاکچین، مفهوم "امضای کیف پول" اهمیت بسیاری دارد. امضای کیف پول به معنای ایجاد یک امضای دیجیتال منحصر به فرد است که توسط کیف پول صورت می‌گیرد. این امضا به‌عنوان تأییدیه‌ای از صحت و اعتبار تراکنش‌ها و اطلاعات در شبکه بلاکچین عمل می‌کند.'
      ),
      e(
        "p",
        null,
        "در واقع، امضای کیف پول از الگوریتم‌های رمزنگاری قوی برای ایجاد یک کلید خصوصی استفاده می‌کند. این کلید خصوصی به صورت امن در داخل کیف پول ذخیره می‌شود و توسط آن، امضای دیجیتالی برای هر تراکنش و انتقال اطلاعات ایجاد می‌شود."
      ),
      e(
        "p",
        null,
        "مزیت اصلی امضای کیف پول در بلاکچین، امنیت و صحت تراکنش‌هاست. امضای دیجیتال توسط کیف پول تأیید می‌کند که تراکنش توسط صاحب کیف پول انجام شده است و هیچ تغییری در اطلاعات تراکنش ایجاد نشده است."
      ),
      e(
        "p",
        null,
        "بنابراین، امضای کیف پول مهمترین عنصری است که برای تأیید هویت و اعتبار تراکنش‌های بلاکچین استفاده می‌شود. با استفاده از این امضا، می‌توان به‌طور قطعی اثبات کرد که یک تراکنش توسط کیف پول مورد نظر صورت گرفته است و هیچ تغییری در آن ایجاد نشده است."
      ),
      e("h2", { id: "امضای-دیجیتال-یک-نیاز", tabindex: "-1" }, [
        e(
          "a",
          {
            class: "header-anchor",
            href: "#امضای-دیجیتال-یک-نیاز",
            "aria-hidden": "true",
          },
          "#"
        ),
        a(" امضای دیجیتال یک نیاز"),
      ]),
      e("p", null, [
        a(
          "هر نیازی از کودکان که توسط خانواده مجازی پرداخت شده باشد و به دست کودک رسیده باشد وارد مرحله تازه ای می‌شود. در این مرحله امکان امضای دیجیتال این نیازها توسط مددکار، شاهد، میانجی و خانواده مجازی فراهم می‌شود که خود پیش نیاز توسعهSAY بر روی بستر بلاک‌چین و تبدیل شدن به سازمانی غیرمتمرکز و خودمختار است. برای بیشتر دانستن از این سازمان‌ها "
        ),
        e(
          "a",
          { href: "https://ethereum.org/fa/dao/", target: "_blank" },
          "اینجا"
        ),
        a(" را کنید."),
      ]),
      e("ul", null, [
        e("li", null, [
          e(
            "p",
            null,
            "اولین امضای هر نیاز می‌بایست توسط مددکاری انجام شود که نیاز را برای کودک ایجاد کرده است. مددکار مشخصات نیاز، سمن، کودک و رسیدها را بررسی مجدد می‌کند و آنها را با امضای خود تأیید می‌کند."
          ),
        ]),
        e("li", null, [
          e(
            "p",
            null,
            "دومین امضا توسط میانجی صورت می‌گیرد. میانجی کالای پرداخت شده را از فروشگاه‌ آنلاین خرید می‌کند و با با امضای خود نیز خرید را تأیید می‌کند."
          ),
        ]),
        e("li", null, [
          e("p", null, [
            a(
              "سومین امضا توسط شاهد انجام می‌شود. شاهد از ابتدای ایجاد نیاز در کنار مددکار در بهبود کیفیت نیاز‌ها فعالیت می‌کند و با امضای دیجیتال نیاز، آن را تأیید نهایی می‌کند و بر روی شبکه غیرمتمرکز IPFS ذخیره می‌کند. برای بیشتر دانستن از این شبکه "
            ),
            e("a", { href: "https://ipfs.tech/", target: "_blank" }, "اینجا"),
            a(" را کلیک کنید."),
          ]),
        ]),
        e("li", null, [
          e(
            "p",
            null,
            "چهارمین امضا توسط عضو یا اعضای خانواده مجازی کودک انجام می‌شود. این افراد نیاز کودک را پرداخت کرده‌اند و با امضای خود رسیدهای مددکار، فروشگاه آنلاین و بانک را بررسی و تایید می‌کنند."
          ),
        ]),
      ]),
      e(
        "div",
        {
          style: {
            display: "flex",
            "justify-content": "center",
            "flex-wrap": "nowrap",
          },
        },
        [
          e("div", { style: { margin: "20px", "text-align": "center" } }, [
            e("img", { src: h, alt: "drawing", width: "60" }),
            e(
              "p",
              {
                style: {
                  "text-align": "center",
                  "line-height": "15px",
                  "font-size": "14px",
                  margin: "0",
                },
              },
              " امضای مددکار "
            ),
          ]),
          e("div", { style: { margin: "20px", "text-align": "center" } }, [
            e("img", { src: c, alt: "drawing", width: "60" }),
            e(
              "p",
              {
                style: {
                  "text-align": "center",
                  "line-height": "15px",
                  "font-size": "14px",
                  margin: "0",
                },
              },
              " امضای میانجی "
            ),
          ]),
          e("div", { style: { margin: "20px", "text-align": "center" } }, [
            e("img", { src: o, alt: "drawing", width: "60" }),
            e(
              "p",
              {
                style: {
                  "text-align": "center",
                  "line-height": "15px",
                  "font-size": "14px",
                  margin: "0",
                },
              },
              " امضای شاهد "
            ),
          ]),
          e("div", { style: { margin: "20px", "text-align": "center" } }, [
            e("img", { src: u, alt: "drawing", width: "60" }),
            e(
              "p",
              {
                style: {
                  "text-align": "center",
                  "line-height": "15px",
                  "font-size": "14px",
                  margin: "0",
                },
              },
              " امضای خانواده مجازی "
            ),
          ]),
        ]
      ),
      e("div", { class: "h_iframe-aparat_embed_frame" }, [
        e("span", { style: { display: "block", "padding-top": "57%" } }),
        e("iframe", {
          style: { right: "0px", margin: "auto" },
          src: "https://www.aparat.com/video/video/embed/videohash/D5V7L/vt/frame",
          allowFullScreen: "true",
          webkitallowfullscreen: "true",
          mozallowfullscreen: "true",
        }),
      ]),
      e("h2", { id: "جزئیات-هر-امضا-🚧", tabindex: "-1" }, [
        e(
          "a",
          {
            class: "header-anchor",
            href: "#جزئیات-هر-امضا-🚧",
            "aria-hidden": "true",
          },
          "#"
        ),
        a(" جزئیات هر امضا 🚧"),
      ]),
      i(` ### مددکار
### شاهد
### میانجی
### خانواده مجازی  `),
      e("p", null, "..."),
      e("h2", { id: "خلق-توکن-از-یک-نیاز-🚧", tabindex: "-1" }, [
        e(
          "a",
          {
            class: "header-anchor",
            href: "#خلق-توکن-از-یک-نیاز-🚧",
            "aria-hidden": "true",
          },
          "#"
        ),
        a(" خلق توکن از یک نیاز 🚧"),
      ]),
      e("p", null, "..."),
      e("div", { class: "custom-container warning" }, [
        e("p", { class: "custom-container-title" }, "WARNING"),
        e("p", null, "این سند در حال توسعه و بهبود است."),
      ]),
    ],
    -1
  ),
  g = [m];
function _(x, f) {
  return t(), n("div", null, g);
}
const v = l(p, [
  ["render", _],
  ["__file", "wallet.html.vue"],
]);
export { v as default };
